## Azure SQL Database

In [19]:
from sqlalchemy import create_engine
import pandas as pd
import pyspark as ps
import getpass

In [2]:
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline
%config InlineBackend.figure_format='retina'

In [15]:
print(f'pandas   version: {pd.__version__}')

pandas   version: 2.1.3

## DB Connection

In [31]:
import pyodbc
# from sqlalchemy import create_engine
# import pandas as pd

user = ""
pwd = ""
dbname = ""
host = ".database.windows.net"
port = 

driver = "ODBC Driver 17 for SQL Server"

connection_string = f"Driver={driver};Server={host};Database={dbname};Uid={user};Pwd={pwd};Port={port}"

# engine = create_engine(connection_string)

connection = pyodbc.connect(connection_string)

In [ ]:
# Not in use

user=getpass.getpass('enter Azure SQL user name')
pwd=getpass.getpass('enter Azure SQL password')

In [ ]:
# Not in use

driver = 'ODBC Driver 17 for SQL Server'.replace(' ', '+')
dbname=''
host='.database.windows.net'
port=

con = create_engine(f'mssql+pyodbc://{user}:{pwd}@{host}/{dbname}?driver={driver}')

## All data management commands

In [20]:
# Create a cursor and show all table name

cursor = connection.cursor()

cursor.execute("SELECT name FROM sys.tables")

table_names = [row[0] for row in cursor.fetchall()]

print(table_names)

['regions', 'countries', 'locations', 'jobs', 'departments', 'employees', 'dependents']

In [23]:
cursor.execute("select * from regions")

# Fetch the first 5 rows
data = cursor.fetchmany(5)

data

[(1, 'Europe'), (2, 'Americas'), (3, 'Asia'), (4, 'Middle East and Africa')]

In [26]:
import warnings
warnings.filterwarnings("ignore", category=UserWarning)

df = pd.read_sql("select * from regions", connection)

df = df.iloc[:5]

print(df)

   region_id             region_name
0          1                  Europe
1          2                Americas
2          3                    Asia
3          4  Middle East and Africa

In [28]:
df = pd.read_sql("select * from regions", connection)

df = df.iloc[:5]

print(df)

   region_id             region_name
0          1                  Europe
1          2                Americas
2          3                    Asia
3          4  Middle East and Africa

In [35]:
df = pd.read_sql("select * from countries", connection)

# df = df.iloc[:5]

print(df)

   country_id              country_name  region_id
0          AR                 Argentina          2
1          AU                 Australia          3
2          BE                   Belgium          1
3          BR                    Brazil          2
4          CA                    Canada          2
5          CH               Switzerland          1
6          CN                     China          3
7          DE                   Germany          1
8          DK                   Denmark          1
9          EG                     Egypt          4
10         FR                    France          1
11         HK                  HongKong          3
12         IL                    Israel          4
13         IN                     India          3
14         IT                     Italy          1
15         JP                     Japan          3
16         KW                    Kuwait          4
17         MX                    Mexico          2
18         NG                   Nigeria          4
19         NL               Netherlands          1
20         SG                 Singapore          3
21         UK            United Kingdom          1
22         US  United States of America          2
23         ZM                    Zambia          4
24         ZW                  Zimbabwe          4

In [36]:
df = pd.read_sql("select * from jobs", connection)

print(df)

    job_id                        job_title  min_salary  max_salary
0        1                Public Accountant      4200.0      9000.0
1        2               Accounting Manager      8200.0     16000.0
2        3         Administration Assistant      3000.0      6000.0
3        4                        President     20000.0     40000.0
4        5    Administration Vice President     15000.0     30000.0
5        6                       Accountant      4200.0      9000.0
6        7                  Finance Manager      8200.0     16000.0
7        8   Human Resources Representative      4000.0      9000.0
8        9                       Programmer      4000.0     10000.0
9       10                Marketing Manager      9000.0     15000.0
10      11         Marketing Representative      4000.0      9000.0
11      12  Public Relations Representative      4500.0     10500.0
12      13                 Purchasing Clerk      2500.0      5500.0
13      14               Purchasing Manager      8000.0     15000.0
14      15                    Sales Manager     10000.0     20000.0
15      16             Sales Representative      6000.0     12000.0
16      17                   Shipping Clerk      2500.0      5500.0
17      18                      Stock Clerk      2000.0      5000.0
18      19                    Stock Manager      5500.0      8500.0

In [41]:
df = pd.read_sql("select * from locations", connection)

print(df)

   location_id                            street_address postal_code  \
0         1400                       2014 Jabberwocky Rd       26192
1         1500                       2011 Interiors Blvd       99236
2         1700                           2004 Charade Rd       98199
3         1800                           147 Spadina Ave     M5V 2L7
4         2400                            8204 Arthur St        None
5         2500  Magdalen Centre, The Oxford Science Park     OX9 9ZB
6         2700                     Schwanthalerstr. 7031       80925

                  city state_province country_id
0            Southlake          Texas         US
1  South San Francisco     California         US
2              Seattle     Washington         US
3              Toronto        Ontario         CA
4               London           None         UK
5               Oxford         Oxford         UK
6               Munich        Bavaria         DE

In [40]:
df = pd.read_sql("select * from departments", connection)

print(df)

    department_id   department_name  location_id
0               1    Administration         1700
1               2         Marketing         1800
2               3        Purchasing         1700
3               4   Human Resources         2400
4               5          Shipping         1500
5               6                IT         1400
6               7  Public Relations         2700
7               8             Sales         2500
8               9         Executive         1700
9              10           Finance         1700
10             11        Accounting         1700

In [39]:
df = pd.read_sql("select * from employees", connection)

print(df)

    employee_id   first_name    last_name                              email  \
0           100       Steven         King        steven.king@sqltutorial.org
1           101        Neena      Kochhar      neena.kochhar@sqltutorial.org
2           102          Lex      De Haan        lex.de haan@sqltutorial.org
3           103    Alexander       Hunold   alexander.hunold@sqltutorial.org
4           104        Bruce        Ernst        bruce.ernst@sqltutorial.org
5           105        David       Austin       david.austin@sqltutorial.org
6           106        Valli    Pataballa    valli.pataballa@sqltutorial.org
7           107        Diana      Lorentz      diana.lorentz@sqltutorial.org
8           108        Nancy    Greenberg    nancy.greenberg@sqltutorial.org
9           109       Daniel       Faviet      daniel.faviet@sqltutorial.org
10          110         John         Chen          john.chen@sqltutorial.org
11          111       Ismael      Sciarra     ismael.sciarra@sqltutorial.org
12          112  Jose Manuel        Urman  jose manuel.urman@sqltutorial.org
13          113         Luis         Popp          luis.popp@sqltutorial.org
14          114          Den     Raphaely       den.raphaely@sqltutorial.org
15          115    Alexander         Khoo     alexander.khoo@sqltutorial.org
16          116       Shelli        Baida       shelli.baida@sqltutorial.org
17          117        Sigal       Tobias       sigal.tobias@sqltutorial.org
18          118          Guy       Himuro         guy.himuro@sqltutorial.org
19          119        Karen   Colmenares   karen.colmenares@sqltutorial.org
20          120      Matthew        Weiss      matthew.weiss@sqltutorial.org
21          121         Adam        Fripp         adam.fripp@sqltutorial.org
22          122        Payam     Kaufling     payam.kaufling@sqltutorial.org
23          123       Shanta      Vollman     shanta.vollman@sqltutorial.org
24          126        Irene  Mikkilineni  irene.mikkilineni@sqltutorial.org
25          145         John      Russell       john.russell@sqltutorial.org
26          146        Karen     Partners     karen.partners@sqltutorial.org
27          176     Jonathon       Taylor    jonathon.taylor@sqltutorial.org
28          177         Jack   Livingston    jack.livingston@sqltutorial.org
29          178    Kimberely        Grant    kimberely.grant@sqltutorial.org
30          179      Charles      Johnson    charles.johnson@sqltutorial.org
31          192        Sarah         Bell         sarah.bell@sqltutorial.org
32          193      Britney      Everett    britney.everett@sqltutorial.org
33          200     Jennifer       Whalen    jennifer.whalen@sqltutorial.org
34          201      Michael    Hartstein  michael.hartstein@sqltutorial.org
35          202          Pat          Fay            pat.fay@sqltutorial.org
36          203        Susan       Mavris       susan.mavris@sqltutorial.org
37          204      Hermann         Baer       hermann.baer@sqltutorial.org
38          205      Shelley      Higgins    shelley.higgins@sqltutorial.org
39          206      William        Gietz      william.gietz@sqltutorial.org

    phone_number   hire_date  job_id   salary  manager_id  department_id
0   515.123.4567  1987-06-17       4  24000.0         NaN              9
1   515.123.4568  1989-09-21       5  17000.0       100.0              9
2   515.123.4569  1993-01-13       5  17000.0       100.0              9
3   590.423.4567  1990-01-03       9   9000.0       102.0              6
4   590.423.4568  1991-05-21       9   6000.0       103.0              6
5   590.423.4569  1997-06-25       9   4800.0       103.0              6
6   590.423.4560  1998-02-05       9   4800.0       103.0              6
7   590.423.5567  1999-02-07       9   4200.0       103.0              6
8   515.124.4569  1994-08-17       7  12000.0       101.0             10
9   515.124.4169  1994-08-16       6   9000.0       108.0             10
10  515.124.4269  1997-09-28       6   8200.0       108.0             10
11  515.124.4369  1997-09-30       6   7700.0       108.0             10
12  515.124.4469  1998-03-07       6   7800.0       108.0             10
13  515.124.4567  1999-12-07       6   6900.0       108.0             10
14  515.127.4561  1994-12-07      14  11000.0       100.0              3
15  515.127.4562  1995-05-18      13   3100.0       114.0              3
16  515.127.4563  1997-12-24      13   2900.0       114.0              3
17  515.127.4564  1997-07-24      13   2800.0       114.0              3
18  515.127.4565  1998-11-15      13   2600.0       114.0              3
19  515.127.4566  1999-08-10      13   2500.0       114.0              3
20  650.123.1234  1996-07-18      19   8000.0       100.0              5
21  650.123.2234  1997-04-10      19   8200.0       100.0              5
22  650.123.3234  1995-05-01      19   7900.0       100.0              5
23  650.123.4234  1997-10-10      19   6500.0       100.0              5
24  650.124.1224  1998-09-28      18   2700.0       120.0              5
25          None  1996-10-01      15  14000.0       100.0              8
26          None  1997-01-05      15  13500.0       100.0              8
27          None  1998-03-24      16   8600.0       100.0              8
28          None  1998-04-23      16   8400.0       100.0              8
29          None  1999-05-24      16   7000.0       100.0              8
30          None  2000-01-04      16   6200.0       100.0              8
31  650.501.1876  1996-02-04      17   4000.0       123.0              5
32  650.501.2876  1997-03-03      17   3900.0       123.0              5
33  515.123.4444  1987-09-17       3   4400.0       101.0              1
34  515.123.5555  1996-02-17      10  13000.0       100.0              2
35  603.123.6666  1997-08-17      11   6000.0       201.0              2
36  515.123.7777  1994-06-07       8   6500.0       101.0              4
37  515.123.8888  1994-06-07      12  10000.0       101.0              7
38  515.123.8080  1994-06-07       2  12000.0       101.0             11
39  515.123.8181  1994-06-07       1   8300.0       205.0             11

In [38]:
df = pd.read_sql("select * from dependents", connection)

print(df)

    dependent_id first_name   last_name relationship  employee_id
0              1   Penelope       Gietz        Child          206
1              2       Nick     Higgins        Child          205
2              3         Ed      Whalen        Child          200
3              4   Jennifer        King        Child          100
4              5     Johnny     Kochhar        Child          101
5              6      Bette     De Haan        Child          102
6              7      Grace      Faviet        Child          109
7              8    Matthew        Chen        Child          110
8              9        Joe     Sciarra        Child          111
9             10  Christian       Urman        Child          112
10            11       Zero        Popp        Child          113
11            12       Karl   Greenberg        Child          108
12            13        Uma      Mavris        Child          203
13            14     Vivien      Hunold        Child          103
14            15       Cuba       Ernst        Child          104
15            16       Fred      Austin        Child          105
16            17      Helen   Pataballa        Child          106
17            18        Dan     Lorentz        Child          107
18            19        Bob   Hartstein        Child          201
19            20    Lucille         Fay        Child          202
20            21    Kirsten        Baer        Child          204
21            22      Elvis        Khoo        Child          115
22            23     Sandra       Baida        Child          116
23            24    Cameron      Tobias        Child          117
24            25      Kevin      Himuro        Child          118
25            26        Rip  Colmenares        Child          119
26            27      Julia    Raphaely        Child          114
27            28      Woody     Russell        Child          145
28            29       Alec    Partners        Child          146
29            30     Sandra      Taylor        Child          176